# ValueParsingOptions Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ValueParsingOptions Properties
ValueParsingOptions Class See Also
---
The ValueParsingOptions type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AllowedValues | The allowable range of values to be parsed. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
ValueParsingOptions Class
Autodesk.Revit.DB Namespace